Enums/NomenclaturePropertyAssignmentLevel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>NomenclaturePropertyAssignmentLevel</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>DoNotUse</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NomenclatureCategoryLevel</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NomenclatureItemLevel</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Nomenclature.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Nomenclature</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.NomenclatureCategories</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Unit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Units</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Article</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionLong</Name>
					<Comment>Descriptive name</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EnableCustomsDeclarations</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EnableSerialNumbers</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.NomenclatureTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccessGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.NomenclatureAccessGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>UserDefinedProperties</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalPropertiesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalPropertiesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/NomenclaturePackages.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>NomenclaturePackages</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.NomenclatureCategories</xr:Item>
				<xr:Item>Catalog.Nomenclature</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Unit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Units</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConversionFactor</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ModuleWarehouse/Ext/Module.bsl
Function CheckPackageUseAndGetChoiceList(Nomenclature, ChoiceData, SearchString = Undefined) Export

	Query = New Query(
	"SELECT
	|	ISNULL(CatalogPackages.Ref, UNDEFINED) AS Package,
	|	PRESENTATION(CatalogPackages.Ref) AS PackagePresentation,
	|	PRESENTATION(CatalogPackages.ConversionFactor) AS ConversionFactorPresentation,
	|	PRESENTATION(CatalogNomenclature.Unit) AS UnitPresentation,
	|	CASE
	|		WHEN CatalogNomenclature.Category.PackageUse = VALUE(Enum.NomenclaturePropertyAssignmentLevel.DoNotUse)
	|			THEN FALSE
	|		ELSE TRUE
	|	END AS UsePackages
	|FROM
	|	Catalog.Nomenclature AS CatalogNomenclature
	|		LEFT JOIN Catalog.NomenclaturePackages AS CatalogPackages
	|		ON (CatalogPackages.Owner = CASE
	|				WHEN CatalogNomenclature.Category.PackageUse = VALUE(Enum.NomenclaturePropertyAssignmentLevel.NomenclatureCategoryLevel)
	|					THEN CatalogNomenclature.Category
	|				WHEN CatalogNomenclature.Category.PackageUse = VALUE(Enum.NomenclaturePropertyAssignmentLevel.NomenclatureItemLevel)
	|					THEN CatalogNomenclature.Ref
	|				ELSE FALSE
	|			END)
	|WHERE
	|	CatalogNomenclature.Ref = &Nomenclature" + ?(SearchString = Undefined, "", "AND CatalogPackages.Description LIKE &SearchString") + "
	|ORDER BY
	|	CatalogPackages.ConversionFactor,
	|	CatalogPackages.Ref
	|AUTOORDER
	|");

	Query.SetParameter("Nomenclature", Nomenclature);

	If SearchString <> Undefined Then
		Query.SetParameter("SearchString", SearchString + "%");
	EndIf;

	Selection = Query.Execute().Choose();
	While Selection.Next() Do
		If Selection.UsePackages Then
			If Selection.Package <> Undefined Then
				ChoiceData.Add(Selection.Package, Selection.PackagePresentation
				   + " (" + Selection.ConversionFactorPresentation + " " + Selection.UnitPresentation + ")");
			EndIf;
		Else
			Return False;
		EndIf;
	EndDo;

	Return True;

EndFunction



Function CheckCharacteristicUseAndGetChoiceList(Nomenclature, ChoiceData, SearchString = Undefined) Export

	Query = New Query("SELECT
	                  |	ISNULL(CatalogCharacteristics.Ref, UNDEFINED) AS Characteristic,
	                  |	PRESENTATION(CatalogCharacteristics.Ref) AS CharacteristicPresentation,
	                  |	CASE
	                  |		WHEN CatalogNomenclature.Category.CharacteristicUse = VALUE(Enum.NomenclaturePropertyAssignmentLevel.DoNotUse)
	                  |			THEN FALSE
	                  |		ELSE TRUE
	                  |	END AS EnableCharacteristics
	                  |FROM
	                  |	Catalog.Nomenclature AS CatalogNomenclature
	                  |		LEFT JOIN Catalog.NomenclatureCharacteristics AS CatalogCharacteristics
	                  |		ON (CatalogCharacteristics.Owner = CASE
	                  |				WHEN CatalogNomenclature.Category.CharacteristicUse = VALUE(Enum.NomenclaturePropertyAssignmentLevel.NomenclatureCategoryLevel)
	                  |					THEN CatalogNomenclature.Category
	                  |				WHEN CatalogNomenclature.Category.CharacteristicUse = VALUE(Enum.NomenclaturePropertyAssignmentLevel.NomenclatureItemLevel)
	                  |					THEN CatalogNomenclature.Ref
	                  |				ELSE FALSE
	                  |			END)
	                  |WHERE
	                  |	CatalogNomenclature.Ref = &Nomenclature" + ?(SearchString = Undefined, "", "AND CatalogCharacteristics.Description Like &SearchString") + "
					  |ORDER BY
					  |	CatalogCharacteristics.Ref
					  |AUTOORDER
					  |");

	Query.SetParameter("Nomenclature", Nomenclature);

	If SearchString <> Undefined Then
		Query.SetParameter("SearchString", SearchString + "%");
	EndIf;

	Selection = Query.Execute().Choose();
	While Selection.Next() Do
		If Selection.EnableCharacteristics Then
			If Selection.Characteristic <> Undefined Then
				ChoiceData.Add(Selection.Characteristic, Selection.CharacteristicPresentation);
			EndIf;
		Else
			Return False;
		EndIf;
	EndDo;

	Return True;

EndFunction



Function CheckCharacteristicUseAndGetOwnerToChoose(Nomenclature, CharacteristicOwner) Export

	StructureAttributes = New Structure;
	StructureAttributes.Insert("NomenclatureCategory"           , "Category");
	StructureAttributes.Insert("CharacteristicUse", "Category.CharacteristicUse");
	AttributeValues = ModuleCommon.GetObjectAttributeValues(Nomenclature, StructureAttributes);

	If AttributeValues.CharacteristicUse = Enums.NomenclaturePropertyAssignmentLevel.DoNotUse Then
		CharacteristicUse = False;
	Else
		CharacteristicUse = True;

		If AttributeValues.CharacteristicUse = Enums.NomenclaturePropertyAssignmentLevel.NomenclatureCategoryLevel Then
			CharacteristicOwner = AttributeValues.NomenclatureCategory;
		Else
			CharacteristicOwner = Nomenclature;
		EndIf;
	EndIf;

	Return CharacteristicUse;

EndFunction
